### Importando pandas

In [74]:
import pandas as pd

### Importando Database

In [75]:
from sqlalchemy import create_engine

### Criando a conexão

In [76]:
import pymysql
import urllib.parse

# Definir as credenciais
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar URL de conexão

connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar conexão com o create_engine()
engine = create_engine(connection_string)

# Escrever consulta SQL

query_alunos = "SELECT * FROM aluno"

# Criar DataFrame

df_alunos = pd.read_sql(query_alunos, engine)

# Mostrar 5 primeiros
df_alunos.head()

    id        ra  nome  tempo_de_estudo  renda_media_familia
0  114  00034548  None              NaN                  NaN
1  115  00034549  None              NaN                  NaN
2  116  00034547  None              NaN                  NaN
3  117  00034546  None              NaN                  NaN
4  118  00034550  None              NaN                  NaN

#### Quais a bibliotecas um cientista de dados utiliza?
- Pandas;
- NumPy;
- Fundamentos de IA (Scikit-learn)

#### Material didático
- Pandas e NumPy (Notebook)
- Scikit-Learn (Apostila do SENAI)

##### Pandas: ciência de dados
##### Scikit-Learn: elaboração de modelos de IA
##### NumPy: Matemática

05/08/2024

- Carregar dados (ok)

- Salvar um dataframe

In [77]:
csv_file = 'alunos.csv'
df_alunos.to_csv(csv_file, index=False) # Precisa desses dois paramêtros

# Exercício - Salve o DataFrame no formato JSON

In [78]:
json_file = 'alunos.json'
df_alunos.to_json(json_file, index=False)

In [79]:
excel_file = 'planilha_alunos.xlsx'
df_alunos.to_excel(excel_file, index=False)

In [80]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempo_de_estudo', 'renda_media_familia'], dtype='object')

In [81]:
df_tempo_renda = df_alunos[['tempo_de_estudo', 'renda_media_familia']]
df_tempo_renda

     tempo_de_estudo  renda_media_familia
0                NaN                  NaN
1                NaN                  NaN
2                NaN                  NaN
3                NaN                  NaN
4                NaN                  NaN
..               ...                  ...
101            495.0            1300000.0
102            505.0            1320000.0
103            515.0            1340000.0
104            525.0            1360000.0
105            535.0            1380000.0

[106 rows x 2 columns]

# Revisando funções básicas

## 06/08/2024
- Exercício 01 - Retorne o dataframe da última aula com as duas primeiras linhas como amostras.

In [82]:
df_tempo_renda.head(2)
# df_tempo_renda[:2]

   tempo_de_estudo  renda_media_familia
0              NaN                  NaN
1              NaN                  NaN

- Exercício 02 - Retorne o dataframe da última aula com as duas últimas linhas como amostras.

In [83]:
df_tempo_renda.tail(2)

     tempo_de_estudo  renda_media_familia
104            525.0            1360000.0
105            535.0            1380000.0

- Exercício 03 - Retorne uma tupla com o número de linhas e colunas.

In [84]:
df_tempo_renda.shape # Retorna a tupla

(106, 2)

- Exercício 04 - Retorne as informações gerais do dataframe.

In [85]:
df_tempo_renda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   tempo_de_estudo      52 non-null     float64
 1   renda_media_familia  52 non-null     float64
dtypes: float64(2)
memory usage: 1.8 KB

In [86]:
qtd = len(df_tempo_renda)
if qtd <= 106:
    print(f'Quantidade: {qtd} dentro do ideal')

Quantidade: 106 dentro do ideal

- Exercício 05 - Retorne as colunas.

In [87]:
df_tempo_renda.columns

Index(['tempo_de_estudo', 'renda_media_familia'], dtype='object')

- Exercício 06 - Retorne as informações apenas da coluna renda familiar.

In [88]:
df_tempo_renda['renda_media_familia'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 106 entries, 0 to 105
Series name: renda_media_familia
Non-Null Count  Dtype
--------------  -----
52 non-null     float64
dtypes: float64(1)
memory usage: 980.0 bytes

- Exercício 07 - Mostre os tipos com dtypes

In [89]:
df_alunos.dtypes

id                       int64
ra                      object
nome                    object
tempo_de_estudo        float64
renda_media_familia    float64
dtype: object

- Estatística

In [90]:
df_alunos.describe() # Faz um resumo, contagem, média, minimo, etc.

               id  tempo_de_estudo  renda_media_familia
count  106.000000        52.000000         5.200000e+01
mean   166.500000       285.596154         8.621538e+05
std     30.743563       144.807683         3.262689e+05
min    114.000000        10.000000         2.000000e+03
25%    140.250000       153.750000         6.150000e+05
50%    166.500000       280.000000         8.700000e+05
75%    192.750000       407.500000         1.125000e+06
max    219.000000       535.000000         1.380000e+06

- Exercício 08 - Crie u dataframe da tabela diário de bordo e mostre os valores.

In [100]:
query_diario = "SELECT * FROM diariobordo"
query_avaliacao = "SELECT * FROM avaliacao"

df_diario = pd.read_sql(query_diario, engine)
df_avaliacao = pd.read_sql(query_avaliacao, engine)

In [101]:
df_diario.head() # Lê os 5 primeiros campos da tabela

,id,texto,datahora,fk_aluno_id
0,120,"Hoje estamos aprendendo MySql, comandos como U...",2024-07-31 15:47:50,150
1,121,Hoje tivemos uma segunda aula sobre banco de d...,2024-07-31 17:45:00,167
2,122,Aula sobre dataframe É importante!,2024-08-06 15:47:50,151
3,123,Aula de revisao do pandas É importante!,2024-08-06 15:43:00,152
4,124,Aula de revisao do SQL!,2024-08-06 16:00:00,153

In [102]:
df_avaliacao.shape # Retorna uma tupla com a qtd de linhas e colunas

(5, 6)

In [103]:
df_avaliacao.columns

Index(['id', 'nota2', 'nota1', 'nota3', 'nota4', 'fk_aluno_id'], dtype='object')

In [104]:
df_avaliacao.describe()

              id      nota2     nota1     nota3      nota4  fk_aluno_id
count   5.000000   5.000000   5.00000   5.00000   5.000000     5.000000
mean    8.000000  22.200000  21.40000  23.00000  24.000000   122.000000
std     1.581139   1.788854   2.19089   2.12132   1.732051     1.581139
min     6.000000  20.000000  20.00000  20.00000  21.000000   120.000000
25%     7.000000  22.000000  20.00000  22.00000  24.000000   121.000000
50%     8.000000  22.000000  20.00000  23.00000  25.000000   122.000000
75%     9.000000  22.000000  22.00000  25.00000  25.000000   123.000000
max    10.000000  25.000000  25.00000  25.00000  25.000000   124.000000

In [105]:
df_avaliacao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   nota2        5 non-null      int64
 2   nota1        5 non-null      int64
 3   nota3        5 non-null      int64
 4   nota4        5 non-null      int64
 5   fk_aluno_id  5 non-null      int64
dtypes: int64(6)
memory usage: 372.0 bytes

### Gerando um arquivo EXCEL

In [98]:
alunos_excel = 'planilha_avaliacao.xlsx' # cria a variavel e de um nome pra sua planilha com a extensão
df_avaliacao.to_excel(alunos_excel, index=False) # Passe 2 parametros